Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: There is no foreach statement any more.
ja: 今やforeach文は存在しない。

source: There is no corresponding native str type.
ja: 対応するネイティブstr型はありません。

source: There is no longer a continue block.
ja: もはやcontinueブロックはない。

source: Therefore, the code calls the .reverse method on the result of the second sort, and stores the final list in @sorted.
ja: したがって、コードは第2のソートの結果に対して.reverseメソッドを呼び出し、最終のリストを@sortedに保存します。

source: Therefore:
ja: したがって：

source: These character classes follow the Unicode definition of what is a letter, a number, and so on.
ja: これらの文字クラスは何が文字、数などであるかというユニコード定義に従います。

source: These adverbial forms all weed out non-existing entries if the adverb is true; if not, they leave them in, just as an ordinary slice would.
ja: 副詞が真である場合はこれらの副詞形式は存在しないエントリーを全て除きます。そうでなければ、通常のスライスのようにそれらを残します。

source: These aliases are also available inside the regex.
ja: これらの別名は正規表現の中でも利用できます。

source: These are far cheaper to check than constraint checks.
ja: 制約がチェックするより、これらをチェックするのははるかに安いです。

source: These are storage locations that every instance of a class will obtain.
ja: これらは、クラスのすべてのインスタンスが得るだろう記憶場所です。

source: These are taken at face value.
ja: それらは表面通りの意味でとられる。

source: These auto-called blocks are known as phasers, since they generally mark the transition from one phase of computing to another.
ja: これらの自動呼び出しされるブロックはphasersとして知られる。だから一つの計算フェーズから他への移行を一般的にマークする。

source: These captures are again Match objects, so match objects are really trees of matches.
ja: これらのキャプチャーは再び Matchオブジェクトであるので、マッチオブジェクトは本当にマッチのツリーです。

source: These circumfix square brackets are the reduction meta operator, which transforms the enclosed infix operator into an operator that expects a list (a listop), and carries out the operation between each two consecutive list items.
ja: これらの接周辞角括弧は縮小メタ演算子です。囲っている接中辞演算子をリストを期待する演算子（listop）に変え、各々の2連続リストアイテムの間で演算を実行します。

source: These constructs establish a dynamic scope without necessarily establishing a lexical scope.
ja: これらの構成物はレキシカルスコープを確立する必要なしに動的スコープを確立する。

source: These dispatch forms may seem rare, but they're very useful for event driven programming.
ja: これらのディスパッチ形式は珍しく見えます。しかし、それらはイベント駆動プログラミングのために非常に有用です。

source: These have the advantage of passing the variable in question into the closure as its topic:
ja: そのトピックとしてのクロージャ内の問題の変数に渡すアドバンテージをそれらは持つ：

source: These implementations have in turn influenced the design of the language by highlighting misfeatures, contradictions, or features of difficult implementation and little benefit.
ja: これらの実装は設計ミス、矛盾または困難な実装と利便性の小さい機能を強調することによって、言語のデザインに次々に影響を与えました。

source: These items each specify a task that must be completed before the present one can complete.
ja: これらのアイテムは、完了することができる現在の前に完了しなければならない仕事を各々指定します。

source: These lines loop over the items in @scores, binding them to the special variable $_ one at a time.
ja: これらの行は@scores上でループし、1つずつそれらを特殊変数$_に結びつけます。

source: These matches extend beyond the ASCII range--\d matches Latin, Arabic-Indic, Devanagari and other digits, \s matches non-breaking whitespace, and so on.
ja: これらのマッチはASCIIの範囲を超えて ― \dはラテン語、アラビア・インド語、デバナーガリーと他の数字にマッチし、\sは非改行空白などにマッチします。

source: These need not be identical contexts, since they may bind or coerce the resulting parcels differently:
ja: それらは同一のコンテキストを必要としない。だから結果として生じるパーセルを違うようにバインドするか強制する：

source: These roles are generally not used directly as object types.
ja: これらのロールがオブジェクト型として直接使われることは通常ありません。

source: These three calls all mean the same thing:
ja: これら3つの呼び出しは同じことを意味します：

source: These two lines of code declare two hashes.
ja: 2行のコードは、2つのハッシュを宣言します。

source: These two tasks contradict each other to some degree.
ja: これらの2つのタスクは、ある程度互いに反対します。

source: These variables are called parameters (footnote: In this book, we will use the traditional convention of using the term parameters when referring to the variables in a subroutine's signature and arguments when referring to the values actually passed when a subroutine is called.
ja: それらの変数はパラメータと呼ばれます（脚注：この本では、我々は従来の表記法のパラメータをサブルーチンシグネチャーの変数とサブルーチンが呼ばれた時に実際に参照する引数に使います。

source: They also provide a mechanism for code re-use.
ja: それらはコード再利用のメカニズムも提供します。

source: They have a special calling syntax, and can manipulate each other.
ja: それらには特別な呼び出し構文があって、互いを操作することができます。

source: They parse the same as phasers:
ja: それらはphasersと同じにパースする：

source: They represent entities in the system, providing models from which to create instances.
ja: それらはシステムで実体を意味します。そしてインスタンスをつくるモデルを提供します。

source: They transform the information they extract from the match object into native Perl 6 data structures, and call make to set those native structures as their own ASTs.
ja: それらはマッチオブジェクトから抜き出した情報をネイティブのPerl 6データ構造に変換して、それらのネイティブ構造を彼ら自身のASTとしてセットするためにmakeを呼びます。

source: This subsignature also acts as a constraint on the array parameter: the signature binding will fail unless the list in the capture contains at least one item.
ja: このサブシグネチャーは配列パラメータの制約としても働きます：キャプチャーのリストが少なくとも1つのアイテムを含まない限り、シグネチャーバインディングは失敗するでしょう。

source: This encapsulation is one of the key principles of object oriented design.
ja: このカプセル化は、オブジェクト指向デザインの重要な原則の1つです。

source: This adverb indicates that the given argument must be bound to a concrete object; if not, a runtime exception will be thrown.
ja: この副詞は与えられた引数が具体的なオブジェクトでなければならないことを示します。そうでなければ実行時例外がスローされます。

source: This allows the two expressions $a = 1, $b = 2 and @a = 1, 2 to both mean something sensible: assignment to two variables in a list, and assignment of a two-item list to a single variable.
ja: これは2つの式$a = 1, $b = 2と@a = 1, 2両方を許します：リストの2つの変数への割り当てと、1つの変数への2アイテムリストの割り当てです。

source: This allows type objects to be assigned to scalars, but to disappear in non-scalar contexts.
ja: これにより型オブジェクトはスカラーに割り当てられることができます。しかし非スカラーコンテキストでは消えます。

source: This allows you to modify the argument inside the subroutine.
ja: これはサブルーチン内で引数を変更することを可能にします。

source: This allows you to restrict the data type of the value returned from a subroutine.
ja: これは、サブルーチンから返される値のデータ型を制限することができます。

source: This allows you to write a regex that detects that common error of duplicated words, just like the example at the beginning of this chapter:
ja: これは、章の初めの例のような複製されたワードのエラーを見つける正規表現を書くのを可能にします：

source: This applies to anything that needs to be looked up at compile time, including names of variables, and named values such as types and subs.
ja: これは実行時に探索される必要がある何にでも適用される。変数名、型やサブルーチンのような名前付きの値を含めて。

source: This assertion is <?after>.
ja: このアサーションは<？after>です。

source: This automatic substitution of code with its contents is interpolation.
ja: このコードによる内容の自動置換は展開です。

source: This basically gives us list comprehensions as rvalue expressions:
ja: これは基本的に右辺値の式としてリストの理解力を我々に与える：

source: This book is a work-in-progress.
ja: この本は編集の作業中です。

source: This book is primarily for people who want to learn Perl 6.
ja: この本は主にPerl 6を学びたい人々のためのものです。

source: This brings Perl 6 a lot of the expressive power provided by pattern matching in various functional languages.
ja: これは、Perl 6にいろいろな関数型言語でパターンマッチによって提供される多くの表現力豊かなパワーをもたらします。

source: This can be a bit cumbersome, so in the particular case of labels, the label that is already visible in the current lexical scope is considered a kind of pseudo object specifying a potential dynamic context.
ja: これは少し扱いづらい。そういうわけでラベルの特定の場合、現在のレキシカルスコープのすでに可視のラベルは潜在的なダイナミックコンテキストを示す擬似オブジェクトの一種とみなされる。

source: This can be useful to peg some behavior to an empty list while still returning an empty list:
ja: これは空のリストを返している間に何らかの振る舞いを空のリストに釘付けるのに役立ちます。

source: This candidate adds two new twists.
ja: この候補は2つの新しいひねりを加えます。

source: This candidate will match only some values of the type Any--those where the value is undefined.
ja: この候補はいくつかのAny型の値だけにマッチします ― それらは未定義の値です。

source: This case behaves the same way as compile-time composition, in that the role composer will compose them all into the imaginary anonymous subclass.
ja: ロールコンポーザーが想像上の匿名のサブクラスにそれらのすべてを合成するだろうという点で、このケースはコンパイル時合成と同じ方法でふるまいます。

source: This chapter's example uses \w to build the definition of a "word".
ja: この章の例は、ワードの定義を構築するために\wを使います。

source: This code defines a single multi sub named to-json, which takes one argument and turns that into a string.
ja: このコードはto-jsonという名前のマルチサブを定義し、それは1つの引数を受け取って文字列にします。

source: This code defines three multis, one of which increases a counter whenever its where clause executes.
ja: このコードは3つのマルチを定義します。そしてそのwhere節を実行するときはいつでも、その内の一つはカウンターを増やします。

source: This code introduces a regex named word, which matches at least one word character, optionally followed by a single quote and some more word characters.
ja: このコードは、wordという名前の正規表現を導入します。それは少なくとも1つのワード文字にマッチし、シングルクォートといくつかのワード文字が任意に続くことができます。

source: This construct only allows you to attach a single statement to the end of an expression.
ja: この構成は単独の文の式の末尾だけで可能だ。

source: This could be done by pushing the resumed exception onto the unhandled list, and then the thrower checking to see if there is only a single resumed exception in the "unhandled" list.
ja: これはハンドルされないリストの上に再開された例外をプッシュすることで行われ、そのとき例外を投げるものは一つだけの再開された例外が「ハンドルされない」リストにあるなら見るためにチェックする。

source: This delegation is common in object destructors, where each subclass may perform some cleanup for its own particular data.
ja: このデリゲーションはオブジェクトデストラクタで一般的です。そこで各々のサブクラスはそれ自身の特定のデータのために若干のクリーンアップを実行します。

source: This does not affect any other instances of the same class; only this one instance has changed.
ja: これは、同じクラスの何の他のインスタンスには影響を及ぼしません；この唯一のインスタンスだけが変わります。

source: This dynamic control is orthogonal to any lexically scoped warning controls, which merely decide whether to call warn() in the first place.
ja: ダイナミックな制御はどんなレキシカルスコープの警告制御にも直交する。そしてそれは単にwarn()を呼ぶかどうか最初の場所で決定する。

source: This easiest way to do this is by calling the bless method, also inherited from Object.
ja: これをする最も簡単な方法はblessメソッドを呼ぶことで、それもObjectから継承します。

source: This example demonstrates how multiple dispatch can encapsulate all of the rules of a popular game.
ja: この例は、複数のディスパッチがどのように人気があるゲームの規則の全てをカプセル化することができるかについて示します。

source: This example makes a very simple text output by printing X characters to represent horizontal bars:
ja: この例は水平バーを表すXという文字を出力することによって非常に単純なテキスト出力を作ります：

source: This example passes an actions object to the grammar's parse method.
ja: この例は、グラマーのparseメソッドにactionsオブジェクトを渡します。

source: This explains some of the why of currying, but not much of the what.
ja: これはなぜカリーなのかを説明します。カリーとは何かについては多くはありません。

source: This expression uses the infix operators - and / for numerical calculations.
ja: この式は接中辞演算子-と/を数値計算に使います。

source: This final candidate matches not only objects for which there is no candidate defined, but it can match for all objects, including Int, Bool, Num.
ja: この最終的な候補は定義される候補がないオブジェクトとマッチします。しかしそれはInt、Bool、Numを含む全てのオブジェクトとマッチすることができます。

source: This function is similar to printf in C and Perl 5.
ja: この機能はC言語とPerl 5のprintfに似ています。

source: This gives a degree of safety, but it happens at runtime and is thus not as safe as compile time composition.
ja: これはある程度の安全性を与えます。しかしそれは実行時に起こるので、コンパイル時合成ほど安全でありません。

source: This happens both for standard methods defined via the method keyword and for methods generated through other means such as attribute accessors.
ja: これはmethodキーワードを通して定義される標準的なメソッドのために、そして、属性アクセッサのような他の手段によって発生するメソッドのために起こります。

source: This has the added benefit of limiting the scope of the $line parameter to the block it's bound to.
ja: これはブロックにバインドされた$lineパラメータのスコープを制限するという追加の利点を持つ。

source: This has the effect of switching the match order of the final two atoms (B and C), but since Perl knows that the regex engine should be looking for the goal, a better error message can be given when the goal does not match.
ja: これは最終的な2つのアトム（BとC）のマッチ順序を変える効果を持っています。しかし正規表現エンジンが最終目的を探すべきであるということをPerlが知っているので、最終目的がマッチしないとき、より良いエラーメッセージが与えられます。

source: This helps Perl 6 provide generic programming, along the lines of generics in C# and Java, or templates in C++.
ja: C#とJavaのジェネリクスまたはC++のテンプレートの系統に沿って、これはPerl 6がジェネリックプログラミングを提供するのを助けます。

source: This implicit conversion is called coercion.
ja: この暗黙変換は、自動型変換と呼ばれます。

source: This implies a right word boundary, so there is no need to use an explicit boundary.
ja: これは右の単語境界を示すので、明示的な境界は必要ありません。

source: This includes $_ and @_, as well as the new $/, which is the return value of the last regex match.
ja: これは$_と@_だけでなく新しい$/、最後の正規表現マッチの戻り値も含みます。

source: This interpolation happens only in strings delimited by double quotes "...".
ja: この展開はダブルクォート"..."で区切られる文字列だけで起こります。

source: This is greedy matching.
ja: これは貪欲なマッチングです。

source: This is a shortcut for:
ja: これは以下の短縮形です：

source: This is also an example of candidates with different arity (number of expected arguments).
ja: これは、異なるarity（期待される引数の数）を持つ候補の例でもあります。

source: This is called multidispatch, and the functions to which Perl can dispatch in this case are multis.
ja: これはマルチディスパッチと呼ばれます。そしてこの場合にPerlがディスパッチできる関数がmultisです。

source: This is called sigil invariance.).
ja: これはシギル不変性と呼ばれます。）

source: This is common in substitutions.
ja: これは置換で一般的です。

source: This is defined as the textually last statement of its top-level list of statements; any statements embedded within those top-level statements are in their own lower-level list of statements and, while they may be a final statement in their subscope, they're not considered the final statement of the outer block in question.
ja: これは文の最上位リストの最後のテキスト文として定義される；それら最上位の文に埋め込まれた任意の文がそれらのより低いレベルのリストにあり、そしてそれらがサブスコープの最後の文かもしれないなら、それらは問題の外側のブロックの最後の文とみなされない。

source: This is done using the returns trait:
ja: これはreturnsトレイトを使って行います：

source: This is equivalent to
ja: これは以下と同等だ。

source: This is especially useful for writing routines that delegate to other routines with the same arguments.
ja: これは、特に同じ引数で他のルーチンへのデリゲートを書くのに役立ちます。

source: This is exactly like normal alternation, but as we'll see in the next section, has the advantage of being extensible.
ja: これはまさに通常の論理和のようです。しかし我々が次のセクションで見るように、拡張可能というアドバンテージを持っています。

source: This is how some invocations could look like (footnote: <The use of random numbers through roll means that you will likely see different output if you try it.)>
ja: これは起動のいくつかの例です（脚注：rollを通しての乱数の使用は、あなたがそれを試すならば、あなたが異なる出力をたぶん見るだろうことを意味します。）

source: This is how some invocations could look like (footnote: The use of random numbers through roll means that you will likely see different output if you try it.)
ja: これはいくつかの起動がどのように見えるかです（注釈：rollを通じた乱数はあなたが試したものと違う出力を見るだろうことを意味します。）

source: This is illustrated in the second $counter output.
ja: これは第二の$counter出力で例示されます。

source: This is less concise to write, due to the optional second parameter:
ja: 第2のオプショナルパラメータを書くのは簡潔ではありません：

source: This is part of the flattening property: after composing a role into the class, the roles in and of themselves are only important when querying the class to determine if it performs the role.
ja: これはプロパティ平坦化の一部です：ロールをクラスに合成した後に、ロールを実行するかどうか決定するためにクラスを問い合わせる場合だけ、それら自身は重要です。

source: This is part of the power of smart matching: more complex types can define interesting and useful ways to compare themselves to other things.
ja: これは、スマートマッチングのパワーの一部です：より複雑な型は、自分自身を他のものと比較する興味深くて役に立つ方法を定義することができます。

source: This is particularly useful for list comprehensions:
ja: これは特にリストの理解の役に立つ：

source: This is particularly useful for the do-once block, since it is officially a loop and can take therefore loop control statements.
ja: これは特にdo-onceブロックに役に立ち、正式なループなのでループ制御文をとることができる。

source: This is seldom really necessary, because it is often a better alternative to make parameters optional.
ja: パラメータを任意にすることがしばしばより良い代わりであるので、これはあまり必要でありません。

source: This is simple to understand.
ja: これは理解するのは簡単です。

source: This is subtly different from Perl 5's behavior, which was to return the value of the last expression evaluated, even if that expression was just a conditional.
ja: これは文が条件付きだけであっても最後に評価された文が返されるというPerl 5の振る舞いと微妙に異なる。

source: This is the mechanism by which the AdminBot class can perform the appropriate on-message method provided by both the KarmaTracking and the Oping roles.
ja: これは、AdminBotクラスがKarmaTrackingとOpingロールによって提供される適切なon-messageメソッドを実行することができるメカニズムです。

source: This is the opposite of the desired order.
ja: これは望ましい順番と逆です。

source: This is useful if you wish to be very specific about what kind of comparison you want and are unsure of the types of the values you are comparing.
ja: あなたがどんな比較を望むか非常にはっきりしていて欲しくて、比較している値の型が不確かであるならば、これは役に立ちます。

source: This is very helpful for bracketing constructs as it puts the brackets near one another.
ja: これはお互いの近くにブラケットを置いて構成物を括弧に入れるのに非常に有効です。

source: This is what will execute every time the subroutine is called.
ja: これはサブルーチンが呼ばれるときに毎回実行します。

source: This iteration places each item--each a Task object--into the topic variable, $_.
ja: この繰り返しはそれぞれのアイテムを ― それぞれのTaskオブジェクトを ― トピック変数$_に入れます。

source: This kind of list should not be confused with the flattening list context.
ja: この種のリストはフラット化リストコンテキストと混同されるべきではありません。

source: This line consists of three individually simple steps.
ja: この行は、3つの個々に単純なステップから成ります。

source: This line tells the compiler which version of Perl the program expects.
ja: この行は、プログラムがどのバージョンのPerlを期待するかについてコンパイラに伝えます。

source: This makes it easy to keep track of what you last "took":
ja: これはあなたが最後に取ったのは何か追い続けるのを簡単にする：

source: This may be overridden by attaching a .resume_value to the warning.
ja: これは.resume_valueを警告に付け加えることでオーバーライドすることもできる。

source: This means that .* will find both those methods that mixed into the object from one or more roles along with any that already existed in the class.
ja: これは、.*が1つ以上のロールからミックスされたメソッドとクラスの中にすでに存在するもの両方を一緒に見つけるということを意味します。

source: This means that CATCH and CONTROL always require a block, since they take an argument that sets $_ to the current topic, so that the innards are able to behave as a switch statement.
ja: これはCATCHとCONTROLが常にブロックを要求することを意味する。それらは$_を現在のトピックにセットする引数をとるので、内部はswitch文として振る舞うことができる。

source: This means that a subroutine may only be called within the scope in which it was declared.
ja: これは、サブルーチンがそれが宣言された範囲の中でのみ呼ばれることができることを意味します。

source: This means that it is possible to dispatch based upon the shape of a data structure.
ja: これは、それがデータ構造の形に基づくディスパッチに可能であることを意味します。

source: This means that the previous example may be simplified to:
ja: これは前の例を次のように単純化できることを意味します：

source: This means that the two nested arrays could not be recovered at the point of delegation.
ja: これは、2つのネストした配列はデリゲートのポイントで復元することができないことを意味します。

source: This means that you can not modify them from inside the subroutine.
ja: これはサブルーチン内でそれらを変更できないことを意味します。

source: This mechanism is really only good for objects that know how to return a boolean value and still remain themselves.
ja: この仕組みは本当にブール値をどのように返すのか知っていてそれら自身がまだ残るオブジェクトにだけ良い。

source: This meta class enables other ways of introspection too:
ja: このメタクラスはイントロスペクションの他の方法も利用可能にします：

source: This metadata can go far beyond that which subroutines, signatures, and parameters normally provide.
ja: このメタデータは、サブルーチン、シグネチャーとパラメータが通常提供するそれをはるかに越えることができます。

source: This modifier allows optional whitespace in the text wherever there one or more whitespace characters appears in the pattern.
ja: そこで1以上の空白文字がパターンで出現する場合はいつでも、この修飾子はテキストで任意の空白文字を許可します。

source: This operator also has a special feature: it causes the parser to interpret any bare identifier on the left-hand side as a string.
ja: この演算子も特殊な機能を持っています： 左側のどんな裸の識別子でも、パーサーに文字列として解釈させます。

source: This prints:
ja: これは次のように出力します：

source: This process of failing and trying again is backtracking.
ja: 失敗して再び試すこのプロセスはバックトラックです。

source: This process of iteration has produced a more cohesive and consistent language specification.
ja: この繰り返しのプロセスは、より結合力があって一貫した言語仕様を生み出しました。

source: This process transforms the match tree into a different tree--in this case, the actual JSON tree.
ja: このプロセスはマッチツリーを異なるツリーに変えます ― この場合、実際のJSONツリーです。

source: This produces the output:
ja: これは次のように出力します：

source: This program demonstrates a simple and pluggable IRC bot framework which understands a few simple commands.
ja: このプログラムは2、3の単純な命令を理解する、単純で接続可能なIRCロボットフレームワークを示します。

source: This program produces the output:
ja: このプログラムは以下のように出力します：

source: This restriction allows a clever compiler optimization: it can sort all candidates by narrowness once to find the candidate with the best matching signature by examining nominal type constraints.
ja: この制約は、賢いコンパイラ最適化を許可します：それは、名目型制約を調べることによって最善のマッチするシグネチャで候補を見つけるために、一回で狭さによってすべての候補を分類することができます。

source: This routine exchanges the contents of its two arguments.
ja: このルーチンは、その2つの引数のコンテンツを交換します。

source: This scalar attribute (with the $ sigil) has a type of Bool.
ja: このスカラー属性（$シギル）はBool型を持ちます。

source: This section is confusing.
ja: このセクションは混乱します。

source: This sidebar gets a bit deep, but it's an important concept.
ja: この側面記事は少し深くなります、しかし、それは重要な概念です。

source: This slot can hold a custom data structure that you create from the action methods.
ja: このスロットは、アクションメソッドから作成するカスタムデータ構造を保持することができます。

source: This snippet demonstrates how multis make the code simpler and more obvious.
ja: この断片は、multisがどのようにコードをより単純でより明らかにするかについて示します。

source: This symmetry can be exploited by declaring a subroutine called MAIN.
ja: この対称性は、MAINと呼んでいるサブルーチンを宣言することによって利用することができます。

source: This type object is a kind of "empty instance" of the class, specifically an instance without any state.
ja: この型オブジェクトは、クラス（特に何の状態のないインスタンスも）の一種の「空インスタンス」です。

source: This type object is an "empty instance" of the class.
ja: この型オブジェクトはクラスの「空のインスタンス」です。

source: This use of a rule rather than a character class allows you to define your own version of whitespace characters (see grammars).
ja: 文字クラスではなくこのルールの使用は、あなた自身のバージョンの空白文字を定義するの可能にします（grammarsを見てください）。

source: This will not cause an infinite loop as long as at least one regex per recursive call consumes at least one character.
ja: 再帰的呼び出しにつき少なくとも1つの正規表現が少なくとも1つの文字を消費する限り、これは無限ループを引き起こさないでしょう。

source: This works for the example, because JSON's specification covers only a few basic structures.
ja: JSONの仕様がほんの少しの基本的な構造だけに適用されるので、これは例で動きます。

source: This works, but the repeated "I don't care about whitespace" units are clumsy.
ja: これは動作します。しかし度重なる「私は空白文字を気にしません」という単位は不恰好です。

source: Those calling the subroutine can then choose whether or not to supply an argument.
ja: それらのサブルーチン呼び出しは引数を供給するかどうか選ぶことができます。

source: Those that are truly global will have global alphabetic names, such as $*PID or @*ARGS.
ja: それらの本当にグローバルなものはアルファベットの名前、$*PIDまたは@*ARGSのようなものを持ちます。

source: Though certain control statements could conceivably be parsed in a self-contained way, for visual consistency all statement-terminating blocks that end in the middle of a line must be terminated by semicolon unless they are naturally terminated by some other statement terminator:
ja: 確実な制御文はおそらく自己完結的な方法でパースできるだろうが、視覚的な一貫性のために、いくつかの他の文末によって自然に終えるのでない限り、行の中間で終わる全ての終端ブロックは必ずセミコロンで終わらなければならない：

source: Though, for the most part, you can consider these terms interchangeable.) Perl 6 signatures go further; they allow you to constrain the type, value, and "definedness" of its arguments and match against and extract parts of complex data structures.
ja: しかし、ほとんどの場合これらの用語は交換可能と考える事ができます。）Perl 6のシグネチャーは更に上を行きます；それらは型、値、引数の“定義”を強制でき、複雑なデータ構造の部分へのマッチと抽出を行うことができます。

source: Three-way Comparison
ja: 三者間の比較

source: Through this mechanism, a generic multi can redirect execution to a more specific version, but the candidate list for this redirection is determined by the caller, not by the lexical scope of the multi, which can't see the caller's lexical scope except through the CALLER:: pseudo package.
ja: このメカニズムの中で、ジェネリックマルチはより明確なバージョンの実行に切り替えることができる。しかしこの切替の候補リストは呼び出し元で決まり、レキシカルスコープのマルチではない。そしてそれはCALLER::擬似パッケージを通す場合を除いて呼び出し元のレキシカルスコープを見ることができない。

source: Thus $answer ~~ 42 actually desugars to a method call like 42.ACCEPTS($answer).
ja: このように、$answer ~~ 42は実は42.ACCEPTS($answer)のようなメソッド呼び出しのデシュガーです。

source: Thus rw parameters still work with captures involved.
ja: このようにrwパラメータはキャプチャーに含まれてもまだ動作します。
